package org.ru.dev;

public class Run {
}

/**
 * Проект - LOGGER
 * Функционал:
 *  Первой очереди:
 *      1. Чтение файлов с логами.
 *          1.1. Работа с файлами на удаленных машинах.
 *          1.2. Работа с несколькими файлами.
 *          1.3. Работа с файлом как с потоком данных
 *          1.4. Работа без блокирования файла/файлов.
 *          1.5. Получение данных их файлов по мере их поступления, получение копии потока данных в файл.
 *      2. Анализ логов.
 *          2.1. Реализоаця парсинга полученных данных с целью выделения записи.
 *          2.2. Сбор данных по селектору.
 *          2.3. Мапинг данных по времени.
 *      3. Вывод результатов анализа логов.
 *  Второй очереди:
 *      1. Реализация интерфейса.
 *      2. Реализация настроек.
 *
 * Технологии;
 *  Java SE 8
 *  Паттерны программирования
 *  TestNG
 *  SpringFramework
 *  JMX
 *  jasper reports
 *  Gradle
 *
 */